jankaluza/qsimkit/CPU/Variants/msp430x24x1.cpp
#ifndef MPY_
#define MPY_ 0x0130
#endif
#ifndef WDTCTL_
#define WDTCTL_ 0x0120
#endif
#ifndef __msp430_headers_flash_h
#define __msp430_headers_flash_h 
#endif
#ifndef SCG0
#define SCG0 0x0040
#endif
#ifndef SCG1
#define SCG1 0x0080
#endif
#ifndef TAIFG
#define TAIFG 0x0001
#endif
#ifndef FCTL1_
#define FCTL1_ 0x0128
#endif
#ifndef LFXT1OF
#define LFXT1OF 0x01
#endif
#ifndef TA0CCTL0_
#define TA0CCTL0_ 0x0162
#endif
#ifndef MC_UPTO_CCR0
#define MC_UPTO_CCR0 MC_1
#endif
#ifndef FN2
#define FN2 0x0004
#endif
#ifndef TBSSEL0
#define TBSSEL0 0x0100
#endif
#ifndef TBSSEL1
#define TBSSEL1 0x0200
#endif
#ifndef TBSSEL2
#define TBSSEL2 0x0400
#endif
#ifndef TA0CCTL1_
#define TA0CCTL1_ 0x0164
#endif
#ifndef MC_UPDOWN
#define MC_UPDOWN MC_3
#endif
#ifndef __MSP430_HAS_PORT3_R__
#define __MSP430_HAS_PORT3_R__ 
#endif
#ifndef CAREF_0
#define CAREF_0 0x00
#endif
#ifndef CAREF_2
#define CAREF_2 0x20
#endif
#ifndef CAREF_3
#define CAREF_3 0x30
#endif
#ifndef __IOMACROS_H_
#define __IOMACROS_H_ 
#endif
#ifndef TA0CCTL2_
#define TA0CCTL2_ 0x0166
#endif
#ifndef __msp430_headers_common_h
#define __msp430_headers_common_h 
#endif
#ifndef P1IES_
#define P1IES_ 0x0024
#endif
#ifndef LFXT1S0
#define LFXT1S0 0x10
#endif
#ifndef LFXT1S1
#define LFXT1S1 0x20
#endif
#ifndef P4IN_
#define P4IN_ 0x001C
#endif
#ifndef __ASSEMBLER__
#define __ASSEMBLER__ 1
#endif
#ifndef VLDOFF
#define VLDOFF 0x00
#endif
#ifndef MOD0
#define MOD0 0x01
#endif
#ifndef CARSEL
#define CARSEL 0x40
#endif
#ifndef XTS
#define XTS 0x40
#endif
#ifndef P5DIR_
#define P5DIR_ 0x0032
#endif
#ifndef TBSSEL_ACLK
#define TBSSEL_ACLK TBSSEL_1
#endif
#ifndef __HAVE_BUILTIN_SETJMP__
#define __HAVE_BUILTIN_SETJMP__ 1
#endif
#ifndef SLSHR1
#define SLSHR1 0x0400
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1
#endif
#ifndef TACCR2
#define TACCR2 TA0CCR2
#endif
#ifndef TA0R_
#define TA0R_ 0x0170
#endif
#ifndef SUMEXT_
#define SUMEXT_ 0x013E
#endif
#ifndef __msp430_have_timerb7
#define __msp430_have_timerb7 
#endif
#ifndef P1OUT_
#define P1OUT_ 0x0021
#endif
#ifndef OP2_
#define OP2_ 0x0138
#endif
#ifndef MC0
#define MC0 0x0010
#endif
#ifndef SEGWRT
#define SEGWRT 0x0080
#endif
#ifndef P1SEL_
#define P1SEL_ 0x0026
#endif
#ifndef OUT
#define OUT 0x0004
#endif
#ifndef CM_POS
#define CM_POS CM_1
#endif
#ifndef CAIFG
#define CAIFG 0x01
#endif
#ifndef USCIAB1RX_VECTOR
#define USCIAB1RX_VECTOR 2
#endif
#ifndef XT2OF
#define XT2OF 0x02
#endif
#ifndef __MSP430_HAS_FLASH2__
#define __MSP430_HAS_FLASH2__ 
#endif
#ifndef P3REN_
#define P3REN_ 0x0010
#endif
#ifndef FN0
#define FN0 0x0001
#endif
#ifndef FN1
#define FN1 0x0002
#endif
#ifndef FN3
#define FN3 0x0008
#endif
#ifndef FN4
#define FN4 0x0010
#endif
#ifndef FN5
#define FN5 0x0020
#endif
#ifndef UCB0I2CIE_
#define UCB0I2CIE_ 0x006C
#endif
#ifndef SELS
#define SELS 0x08
#endif
#ifndef CM_BOTH
#define CM_BOTH CM_3
#endif
#ifndef FSSEL_SMCLK
#define FSSEL_SMCLK FSSEL_2
#endif
#ifndef TASSEL_SMCLK
#define TASSEL_SMCLK TASSEL_2
#endif
#ifndef __SIZE_TYPE__
#define __SIZE_TYPE__ unsigned int
#endif
#ifndef UCA1BR0_
#define UCA1BR0_ 0x00D2
#endif
#ifndef TBCLR
#define TBCLR 0x0004
#endif
#ifndef CAIES
#define CAIES 0x04
#endif
#ifndef UCA1BR1_
#define UCA1BR1_ 0x00D3
#endif
#ifndef XT2S0
#define XT2S0 0x40
#endif
#ifndef XT2S1
#define XT2S1 0x80
#endif
#ifndef UCB1RXBUF_
#define UCB1RXBUF_ 0x00DE
#endif
#ifndef __MSP430_HAS_PORT2_R__
#define __MSP430_HAS_PORT2_R__ 
#endif
#ifndef SCS
#define SCS 0x0800
#endif
#ifndef UCSSEL_UCLKI
#define UCSSEL_UCLKI UCSSEL_0
#endif
#ifndef CCTL1
#define CCTL1 TA0CCTL1
#endif
#ifndef CALDCO_12MHZ_
#define CALDCO_12MHZ_ 0x10FA
#endif
#ifndef CCTL2
#define CCTL2 TA0CCTL2
#endif
#ifndef LPM0
#define LPM0 CPUOFF
#endif
#ifndef LPM1
#define LPM1 SCG0+CPUOFF
#endif
#ifndef LPM2
#define LPM2 SCG1+CPUOFF
#endif
#ifndef LPM3
#define LPM3 SCG1+SCG0+CPUOFF
#endif
#ifndef LPM4
#define LPM4 SCG1+SCG0+OSCOFF+CPUOFF
#endif
#ifndef UCB0RXBUF_
#define UCB0RXBUF_ 0x006E
#endif
#ifndef TBIE
#define TBIE 0x0002
#endif
#ifndef __GNUC_PATCHLEVEL__
#define __GNUC_PATCHLEVEL__ 3
#endif
#ifndef SELM_LFXTCLK
#define SELM_LFXTCLK SELM_3
#endif
#ifndef TIMERB0_VECTOR
#define TIMERB0_VECTOR 26
#endif
#ifndef TBCTL_
#define TBCTL_ 0x0180
#endif
#ifndef RESHI_
#define RESHI_ 0x013C
#endif
#ifndef P4DIR_
#define P4DIR_ 0x001E
#endif
#ifndef XCAP0
#define XCAP0 0x04
#endif
#ifndef XCAP1
#define XCAP1 0x08
#endif
#ifndef P2CA0
#define P2CA0 0x04
#endif
#ifndef P2CA1
#define P2CA1 0x08
#endif
#ifndef P2CA2
#define P2CA2 0x10
#endif
#ifndef P2CA3
#define P2CA3 0x20
#endif
#ifndef P2CA4
#define P2CA4 0x40
#endif
#ifndef CALDCO_1MHZ_
#define CALDCO_1MHZ_ 0x10FE
#endif
#ifndef CALDCO_8MHZ_
#define CALDCO_8MHZ_ 0x10FC
#endif
#ifndef ACCVIFG
#define ACCVIFG 0x0004
#endif
#ifndef __msp430_headers_clock_h
#define __msp430_headers_clock_h 
#endif
#ifndef UCSSEL_ACLK
#define UCSSEL_ACLK UCSSEL_1
#endif
#ifndef CM_DISABLE
#define CM_DISABLE CM_0
#endif
#ifndef FXKEY
#define FXKEY 0x3300
#endif
#ifndef DIVA_DIV2
#define DIVA_DIV2 DIVA_1
#endif
#ifndef DIVA_DIV4
#define DIVA_DIV4 DIVA_2
#endif
#ifndef UCB1I2CIE_
#define UCB1I2CIE_ 0x00DC
#endif
#ifndef BIT1
#define BIT1 0x0002
#endif
#ifndef BIT2
#define BIT2 0x0004
#endif
#ifndef BIT3
#define BIT3 0x0008
#endif
#ifndef BIT4
#define BIT4 0x0010
#endif
#ifndef BIT7
#define BIT7 0x0080
#endif
#ifndef BIT8
#define BIT8 0x0100
#endif
#ifndef BIT9
#define BIT9 0x0200
#endif
#ifndef BITA
#define BITA 0x0400
#endif
#ifndef BITB
#define BITB 0x0800
#endif
#ifndef BITC
#define BITC 0x1000
#endif
#ifndef BITD
#define BITD 0x2000
#endif
#ifndef BITE
#define BITE 0x4000
#endif
#ifndef BITF
#define BITF 0x8000
#endif
#ifndef SELM_XT2CLK
#define SELM_XT2CLK SELM_2
#endif
#ifndef WDTCNTCL
#define WDTCNTCL 0x0008
#endif
#ifndef PORON
#define PORON 0x08
#endif
#ifndef TBR_
#define TBR_ 0x0190
#endif
#ifndef MOD1
#define MOD1 0x02
#endif
#ifndef MOD2
#define MOD2 0x04
#endif
#ifndef MOD3
#define MOD3 0x08
#endif
#ifndef MOD4
#define MOD4 0x10
#endif
#ifndef P2REN_
#define P2REN_ 0x002F
#endif
#ifndef TACCTL2_
#define TACCTL2_ TA0CCTL2_
#endif
#ifndef UC0IE
#define UC0IE IE2
#endif
#ifndef TAIV_CCR2
#define TAIV_CCR2 0x04
#endif
#ifndef NMI_VECTOR
#define NMI_VECTOR 28
#endif
#ifndef TAIV_CCR1
#define TAIV_CCR1 0x02
#endif
#ifndef CCTL0_
#define CCTL0_ TA0CCTL0_
#endif
#ifndef MPYS_
#define MPYS_ 0x0132
#endif
#ifndef OUTMOD0
#define OUTMOD0 0x0020
#endif
#ifndef __msp430_headers_usci_h__
#define __msp430_headers_usci_h__ 
#endif
#ifndef UCA0BR0_
#define UCA0BR0_ 0x0062
#endif
#ifndef CCTL1_
#define CCTL1_ TA0CCTL1_
#endif
#ifndef SVSFG
#define SVSFG 0x01
#endif
#ifndef UCA0BR1_
#define UCA0BR1_ 0x0063
#endif
#ifndef CCTL2_
#define CCTL2_ TA0CCTL2_
#endif
#ifndef UC1IE_
#define UC1IE_ 0x0006
#endif
#ifndef __MSP430_HAS_PORT1_R__
#define __MSP430_HAS_PORT1_R__ 
#endif
#ifndef UCA1IRTCTL_
#define UCA1IRTCTL_ 0x00CE
#endif
#ifndef TBIV_NONE
#define TBIV_NONE 0x00
#endif
#ifndef CALBC1_16MHZ_
#define CALBC1_16MHZ_ 0x10F9
#endif
#ifndef TASSEL_INCLK
#define TASSEL_INCLK TASSEL_3
#endif
#ifndef P3IN_
#define P3IN_ 0x0018
#endif
#ifndef P2IFG_
#define P2IFG_ 0x002B
#endif
#ifndef TIMERA1_VECTOR
#define TIMERA1_VECTOR 16
#endif
#ifndef TASSEL_ACLK
#define TASSEL_ACLK TASSEL_1
#endif
#ifndef UCB1BR0_
#define UCB1BR0_ 0x00DA
#endif
#ifndef TLV_CHECKSUM_
#define TLV_CHECKSUM_ 0x10C0
#endif
#ifndef TACTL_
#define TACTL_ TA0CTL_
#endif
#ifndef CCR0_
#define CCR0_ TA0CCR0_
#endif
#ifndef WDTNMI
#define WDTNMI 0x0020
#endif
#ifndef TA0CCR1_
#define TA0CCR1_ 0x0174
#endif
#ifndef UCB1BR1_
#define UCB1BR1_ 0x00DB
#endif
#ifndef CCR1_
#define CCR1_ TA0CCR1_
#endif
#ifndef OUTMOD_OUT
#define OUTMOD_OUT OUTMOD_0
#endif
#ifndef P3DIR_
#define P3DIR_ 0x001A
#endif
#ifndef DCO0
#define DCO0 0x20
#endif
#ifndef DCO1
#define DCO1 0x40
#endif
#ifndef DCO2
#define DCO2 0x80
#endif
#ifndef TA0CCR0_
#define TA0CCR0_ 0x0172
#endif
#ifndef DIVS_DIV8
#define DIVS_DIV8 DIVS_3
#endif
#ifndef TA0CCR2_
#define TA0CCR2_ 0x0176
#endif
#ifndef FSSEL_MCLK
#define FSSEL_MCLK FSSEL_1
#endif
#ifndef P6OUT_
#define P6OUT_ 0x0035
#endif
#ifndef UCB1I2COA_
#define UCB1I2COA_ 0x017C
#endif
#ifndef WDT_VECTOR
#define WDT_VECTOR 20
#endif
#ifndef SVSON
#define SVSON 0x04
#endif
#ifndef SVSOP
#define SVSOP 0x02
#endif
#ifndef SELM0
#define SELM0 0x40
#endif
#ifndef CAP
#define CAP 0x0100
#endif
#ifndef BUSY
#define BUSY 0x0001
#endif
#ifndef TBIFG
#define TBIFG 0x0001
#endif
#ifndef P6SEL_
#define P6SEL_ 0x0037
#endif
#ifndef UCB0I2COA_
#define UCB0I2COA_ 0x0118
#endif
#ifndef __USER_LABEL_PREFIX__
#define __USER_LABEL_PREFIX__ 
#endif
#ifndef CCI
#define CCI 0x0008
#endif
#ifndef XT2OFF
#define XT2OFF 0x80
#endif
#ifndef __STDC_HOSTED__
#define __STDC_HOSTED__ 1
#endif
#ifndef OUTMOD_SET
#define OUTMOD_SET OUTMOD_1
#endif
#ifndef OUTMOD_RESET_SET
#define OUTMOD_RESET_SET OUTMOD_7
#endif
#ifndef __MSP430_HAS_USCI0__
#define __MSP430_HAS_USCI0__ 
#endif
#ifndef P1REN_
#define P1REN_ 0x0027
#endif
#ifndef MC_STOP
#define MC_STOP MC_0
#endif
#ifndef __msp430_headers_mpy_h
#define __msp430_headers_mpy_h 
#endif
#ifndef TASSEL_TACLK
#define TASSEL_TACLK TASSEL_0
#endif
#ifndef ID_DIV1
#define ID_DIV1 ID_0
#endif
#ifndef ID_DIV2
#define ID_DIV2 ID_1
#endif
#ifndef ID_DIV4
#define ID_DIV4 ID_2
#endif
#ifndef ID_DIV8
#define ID_DIV8 ID_3
#endif
#ifndef TACLR
#define TACLR 0x0004
#endif
#ifndef SLSHR0
#define SLSHR0 0x0200
#endif
#ifndef RESERVED21_VECTOR
#define RESERVED21_VECTOR 10
#endif
#ifndef RESLO_
#define RESLO_ 0x013A
#endif
#ifndef FSSEL0
#define FSSEL0 0x0040
#endif
#ifndef MERAS
#define MERAS 0x0004
#endif
#ifndef __MSP430__
#define __MSP430__ 1
#endif
#ifndef P4SEL_
#define P4SEL_ 0x001F
#endif
#ifndef __WCHAR_TYPE__
#define __WCHAR_TYPE__ int
#endif
#ifndef CAEX
#define CAEX 0x80
#endif
#ifndef __MSP430_HAS_BC2__
#define __MSP430_HAS_BC2__ 
#endif
#ifndef P6IN_
#define P6IN_ 0x0034
#endif
#ifndef CM0
#define CM0 0x4000
#endif
#ifndef CM1
#define CM1 0x8000
#endif
#ifndef TLV_DCO_30_LEN_
#define TLV_DCO_30_LEN_ 0x10F7
#endif
#ifndef WRT
#define WRT 0x0040
#endif
#ifndef P1IFG_
#define P1IFG_ 0x0023
#endif
#ifndef UCB0BR0_
#define UCB0BR0_ 0x006A
#endif
#ifndef WDTPW
#define WDTPW 0x5A00
#endif
#ifndef CAREF0
#define CAREF0 0x10
#endif
#ifndef CAREF1
#define CAREF1 0x20
#endif
#ifndef VLD_1_8V
#define VLD_1_8V 0x10
#endif
#ifndef UCB0BR1_
#define UCB0BR1_ 0x006B
#endif
#ifndef CAIE
#define CAIE 0x02
#endif
#ifndef COV
#define COV 0x0002
#endif
#ifndef OUTMOD_TOGGLE
#define OUTMOD_TOGGLE OUTMOD_4
#endif
#ifndef P2DIR_
#define P2DIR_ 0x002A
#endif
#ifndef VLDON
#define VLDON 0x10
#endif
#ifndef P5OUT_
#define P5OUT_ 0x0031
#endif
#ifndef CAREF_050
#define CAREF_050 CAREF_2
#endif
#ifndef USCIAB1TX_VECTOR
#define USCIAB1TX_VECTOR 0
#endif
#ifndef __MSP430_HAS_USCI_AB1__
#define __MSP430_HAS_USCI_AB1__ 
#endif
#ifndef EEI
#define EEI 0x0008
#endif
#ifndef __MSP430_HAS_MPY__
#define __MSP430_HAS_MPY__ 
#endif
#ifndef __INT_MAX__
#define __INT_MAX__ 32767
#endif
#ifndef MACS_
#define MACS_ 0x0136
#endif
#ifndef CNTL0
#define CNTL0 0x0800
#endif
#ifndef CNTL1
#define CNTL1 0x1000
#endif
#ifndef TBIV_
#define TBIV_ 0x011E
#endif
#ifndef CM_NEG
#define CM_NEG CM_2
#endif
#ifndef TBCCR0_
#define TBCCR0_ 0x0192
#endif
#ifndef FWKEY
#define FWKEY 0xA500
#endif
#ifndef WDTTMSEL
#define WDTTMSEL 0x0010
#endif
#ifndef BCSCTL1_
#define BCSCTL1_ 0x0057
#endif
#ifndef UCA1RXBUF_
#define UCA1RXBUF_ 0x00D6
#endif
#ifndef TBIV_OVERFLOW
#define TBIV_OVERFLOW 0x0E
#endif
#ifndef P5SEL_
#define P5SEL_ 0x0033
#endif
#ifndef BCSCTL2_
#define BCSCTL2_ 0x0058
#endif
#ifndef KEYV
#define KEYV 0x0002
#endif
#ifndef UC1IFG_
#define UC1IFG_ 0x0007
#endif
#ifndef P2IE_
#define P2IE_ 0x002D
#endif
#ifndef BCSCTL3_
#define BCSCTL3_ 0x0053
#endif
#ifndef CAON
#define CAON 0x08
#endif
#ifndef LOCK
#define LOCK 0x0010
#endif
#ifndef __msp430_headers_svs_h
#define __msp430_headers_svs_h 
#endif
#ifndef UCA0RXBUF_
#define UCA0RXBUF_ 0x0066
#endif
#ifndef UCB1TXBUF_
#define UCB1TXBUF_ 0x00DF
#endif
#ifndef UCB1I2CSA_
#define UCB1I2CSA_ 0x017E
#endif
#ifndef DIVM_DIV1
#define DIVM_DIV1 DIVM_0
#endif
#ifndef DIVM_DIV2
#define DIVM_DIV2 DIVM_1
#endif
#ifndef DIVM_DIV4
#define DIVM_DIV4 DIVM_2
#endif
#ifndef BSLSKEY_
#define BSLSKEY_ 0xFFDE
#endif
#ifndef DIVM_DIV8
#define DIVM_DIV8 DIVM_3
#endif
#ifndef __WINT_TYPE__
#define __WINT_TYPE__ unsigned int
#endif
#ifndef __GNUC__
#define __GNUC__ 3
#endif
#ifndef UCB0TXBUF_
#define UCB0TXBUF_ 0x006F
#endif
#ifndef DIVA_DIV1
#define DIVA_DIV1 DIVA_0
#endif
#ifndef CAOUT
#define CAOUT 0x01
#endif
#ifndef CAREF_1
#define CAREF_1 0x10
#endif
#ifndef __MSP430_HAS_PORT6_R__
#define __MSP430_HAS_PORT6_R__ 
#endif
#ifndef SELM_DCOCLK
#define SELM_DCOCLK SELM_0
#endif
#ifndef PORT2_VECTOR
#define PORT2_VECTOR 6
#endif
#ifndef __msp430_headers_gpio_h
#define __msp430_headers_gpio_h 
#endif
#ifndef TBSSEL_TBCLK
#define TBSSEL_TBCLK TBSSEL_0
#endif
#ifndef FSSEL_0
#define FSSEL_0 0x0000
#endif
#ifndef FSSEL_1
#define FSSEL_1 0x0040
#endif
#ifndef FSSEL_2
#define FSSEL_2 0x0080
#endif
#ifndef FSSEL_3
#define FSSEL_3 0x00C0
#endif
#ifndef DIVA_DIV8
#define DIVA_DIV8 DIVA_3
#endif
#ifndef CCIFG
#define CCIFG 0x0001
#endif
#ifndef CCIE
#define CCIE 0x0010
#endif
#ifndef MAC_
#define MAC_ 0x0134
#endif
#ifndef UC0IFG
#define UC0IFG IFG2
#endif
#ifndef LOCKA
#define LOCKA 0x0040
#endif
#ifndef CACTL2_
#define CACTL2_ 0x005A
#endif
#ifndef IFG2_
#define IFG2_ 0x0003
#endif
#ifndef __MSP430_HAS_USCI__
#define __MSP430_HAS_USCI__ 
#endif
#ifndef UCA1IRRCTL_
#define UCA1IRRCTL_ 0x00CF
#endif
#ifndef P2IN_
#define P2IN_ 0x0028
#endif
#ifndef BSLSKEY_DISABLE
#define BSLSKEY_DISABLE 0xAA55
#endif
#ifndef __MSP430_HAS_SVS__
#define __MSP430_HAS_SVS__ 
#endif
#ifndef TAIE
#define TAIE 0x0002
#endif
#ifndef GIE
#define GIE 0x0008
#endif
#ifndef FAIL
#define FAIL 0x0080
#endif
#ifndef TAIV
#define TAIV TA0IV
#endif
#ifndef CLLD0
#define CLLD0 0x0200
#endif
#ifndef CLLD1
#define CLLD1 0x0400
#endif
#ifndef UCB0STAT_
#define UCB0STAT_ 0x006D
#endif
#ifndef TACCR1_
#define TACCR1_ TA0CCR1_
#endif
#ifndef P1DIR_
#define P1DIR_ 0x0022
#endif
#ifndef WDTIS0
#define WDTIS0 0x0001
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef BLKWRT
#define BLKWRT 0x0080
#endif
#ifndef TACCR2_
#define TACCR2_ TA0CCR2_
#endif
#ifndef P4OUT_
#define P4OUT_ 0x001D
#endif
#ifndef OUTMOD_TOGGLE_SET
#define OUTMOD_TOGGLE_SET OUTMOD_6
#endif
#ifndef UCB0I2CSA_
#define UCB0I2CSA_ 0x011A
#endif
#ifndef UCA1STAT_
#define UCA1STAT_ 0x00D5
#endif
#ifndef CCTL0
#define CCTL0 TA0CCTL0
#endif
#ifndef UCA0STAT_
#define UCA0STAT_ 0x0065
#endif
#ifndef CCR0
#define CCR0 TA0CCR0
#endif
#ifndef CCR1
#define CCR1 TA0CCR1
#endif
#ifndef CCR2
#define CCR2 TA0CCR2
#endif
#ifndef MC_CONT
#define MC_CONT MC_2
#endif
#ifndef __msp430_headers_timerb_h__
#define __msp430_headers_timerb_h__ 
#endif
#ifndef UCA1ABCTL_
#define UCA1ABCTL_ 0x00CD
#endif
#ifndef MSP430_NO_HW_MUL
#define MSP430_NO_HW_MUL 1
#endif
#ifndef RSEL0
#define RSEL0 0x01
#endif
#ifndef RSEL1
#define RSEL1 0x02
#endif
#ifndef RSEL2
#define RSEL2 0x04
#endif
#ifndef RSEL3
#define RSEL3 0x08
#endif
#ifndef UCA0IRTCTL_
#define UCA0IRTCTL_ 0x005E
#endif
#ifndef UCSSEL_SMCLK
#define UCSSEL_SMCLK UCSSEL_2
#endif
#ifndef TAIV_NONE
#define TAIV_NONE 0x00
#endif
#ifndef TACTL
#define TACTL TA0CTL
#endif
#ifndef P6REN_
#define P6REN_ 0x0013
#endif
#ifndef TACCR0_
#define TACCR0_ TA0CCR0_
#endif
#ifndef UCA0ABCTL_
#define UCA0ABCTL_ 0x005D
#endif
#ifndef ID0
#define ID0 0x0040
#endif
#ifndef ID1
#define ID1 0x0080
#endif
#ifndef CCIS0
#define CCIS0 0x1000
#endif
#ifndef CCIS1
#define CCIS1 0x2000
#endif
#ifndef CALBC1_12MHZ_
#define CALBC1_12MHZ_ 0x10FB
#endif
#ifndef __USING_SJLJ_EXCEPTIONS__
#define __USING_SJLJ_EXCEPTIONS__ 1
#endif
#ifndef EMEX
#define EMEX 0x0020
#endif
#ifndef TIMERA0_VECTOR
#define TIMERA0_VECTOR 18
#endif
#ifndef SVSCTL_
#define SVSCTL_ 0x0056
#endif
#ifndef TAR_
#define TAR_ TA0R_
#endif
#ifndef CCR2_
#define CCR2_ TA0CCR2_
#endif
#ifndef UCB0CTL0_
#define UCB0CTL0_ 0x0068
#endif
#ifndef EEIEX
#define EEIEX 0x0010
#endif
#ifndef __MSP430_HAS_PORT5_R__
#define __MSP430_HAS_PORT5_R__ 
#endif
#ifndef UCB0CTL1_
#define UCB0CTL1_ 0x0069
#endif
#ifndef DIVS_DIV1
#define DIVS_DIV1 DIVS_0
#endif
#ifndef DIVS_DIV2
#define DIVS_DIV2 DIVS_1
#endif
#ifndef DIVS_DIV4
#define DIVS_DIV4 DIVS_2
#endif
#ifndef BSLSKEY_NO_ERASE
#define BSLSKEY_NO_ERASE 0x0000
#endif
#ifndef CAREF_OFF
#define CAREF_OFF CAREF_0
#endif
#ifndef ERASE
#define ERASE 0x0002
#endif
#ifndef UCA0CTL0_
#define UCA0CTL0_ 0x0060
#endif
#ifndef __MSP430_HAS_WDT__
#define __MSP430_HAS_WDT__ 
#endif
#ifndef TA0CTL_
#define TA0CTL_ 0x0160
#endif
#ifndef UCA0MCTL_
#define UCA0MCTL_ 0x0064
#endif
#ifndef UCA0CTL1_
#define UCA0CTL1_ 0x0061
#endif
#ifndef __MSP430_HAS_CAPLUS__
#define __MSP430_HAS_CAPLUS__ 
#endif
#ifndef P5IN_
#define P5IN_ 0x0030
#endif
#ifndef TBCCTL1_
#define TBCCTL1_ 0x0184
#endif
#ifndef TBSSEL_INCLK
#define TBSSEL_INCLK TBSSEL_3
#endif
#ifndef OUTMOD1
#define OUTMOD1 0x0040
#endif
#ifndef OUTMOD2
#define OUTMOD2 0x0080
#endif
#ifndef WAIT
#define WAIT 0x0008
#endif
#ifndef OUTMOD_TOGGLE_RESET
#define OUTMOD_TOGGLE_RESET OUTMOD_2
#endif
#ifndef USCIAB0TX_VECTOR
#define USCIAB0TX_VECTOR 12
#endif
#ifndef FSSEL_ACLK
#define FSSEL_ACLK FSSEL_0
#endif
#ifndef IE2_
#define IE2_ 0x0001
#endif
#ifndef CALDCO_16MHZ_
#define CALDCO_16MHZ_ 0x10F8
#endif
#ifndef TBCLGRP0
#define TBCLGRP0 0x2000
#endif
#ifndef TBCLGRP1
#define TBCLGRP1 0x4000
#endif
#ifndef IE1_
#define IE1_ 0x0000
#endif
#ifndef BIT0
#define BIT0 0x0001
#endif
#ifndef P3OUT_
#define P3OUT_ 0x0019
#endif
#ifndef RESERVED20_VECTOR
#define RESERVED20_VECTOR 8
#endif
#ifndef OUTMOD_SET_RESET
#define OUTMOD_SET_RESET OUTMOD_3
#endif
#ifndef TAIV_
#define TAIV_ TA0IV_
#endif
#ifndef DIVA0
#define DIVA0 0x10
#endif
#ifndef DIVA1
#define DIVA1 0x20
#endif
#ifndef OUTMOD_RESET
#define OUTMOD_RESET OUTMOD_5
#endif
#ifndef USCIAB0RX_VECTOR
#define USCIAB0RX_VECTOR 14
#endif
#ifndef BIT5
#define BIT5 0x0020
#endif
#ifndef __GXX_ABI_VERSION
#define __GXX_ABI_VERSION 102
#endif
#ifndef BIT6
#define BIT6 0x0040
#endif
#ifndef __msp430_headers_timera_h__
#define __msp430_headers_timera_h__ 
#endif
#ifndef TAR
#define TAR TA0R
#endif
#ifndef WDTHOLD
#define WDTHOLD 0x0080
#endif
#ifndef TASSEL0
#define TASSEL0 0x0100
#endif
#ifndef TASSEL1
#define TASSEL1 0x0200
#endif
#ifndef TASSEL2
#define TASSEL2 0x0400
#endif
#ifndef FSSEL1
#define FSSEL1 0x0080
#endif
#ifndef P1IE_
#define P1IE_ 0x0025
#endif
#ifndef __msp430x24x1
#define __msp430x24x1 
#endif
#ifndef P3SEL_
#define P3SEL_ 0x001B
#endif
#ifndef TIMERB1_VECTOR
#define TIMERB1_VECTOR 24
#endif
#ifndef TA0IV_
#define TA0IV_ 0x012E
#endif
#ifndef SHR0
#define SHR0 0x2000
#endif
#ifndef SHR1
#define SHR1 0x4000
#endif
#ifndef IFG1_
#define IFG1_ 0x0002
#endif
#ifndef P5REN_
#define P5REN_ 0x0012
#endif
#ifndef TBSSEL_SMCLK
#define TBSSEL_SMCLK TBSSEL_2
#endif
#ifndef UCB1STAT_
#define UCB1STAT_ 0x00DD
#endif
#ifndef CAF
#define CAF 0x02
#endif
#ifndef TBCCR1_
#define TBCCR1_ 0x0194
#endif
#ifndef CAPD7
#define CAPD7 0x80
#endif
#ifndef __GNUC_MINOR__
#define __GNUC_MINOR__ 2
#endif
#ifndef __MSP430
#define __MSP430 1
#endif
#ifndef CASHORT
#define CASHORT 0x80
#endif
#ifndef CACTL1_
#define CACTL1_ 0x0059
#endif
#ifndef TBCCR2_
#define TBCCR2_ 0x0196
#endif
#ifndef COMPARATORA_VECTOR
#define COMPARATORA_VECTOR 22
#endif
#ifndef TBCCTL0_
#define TBCCTL0_ 0x0182
#endif
#ifndef TBCCR3_
#define TBCCR3_ 0x0198
#endif
#ifndef __MSP430_HAS_TB7__
#define __MSP430_HAS_TB7__ 
#endif
#ifndef CALBC1_8MHZ_
#define CALBC1_8MHZ_ 0x10FD
#endif
#ifndef TBCCR4_
#define TBCCR4_ 0x019A
#endif
#ifndef TBCCTL2_
#define TBCCTL2_ 0x0186
#endif
#ifndef TBCCR5_
#define TBCCR5_ 0x019C
#endif
#ifndef __MSP430_HAS_PORT4_R__
#define __MSP430_HAS_PORT4_R__ 
#endif
#ifndef TACCTL0_
#define TACCTL0_ TA0CCTL0_
#endif
#ifndef WDTSSEL
#define WDTSSEL 0x0004
#endif
#ifndef __STDC__
#define __STDC__ 1
#endif
#ifndef MC1
#define MC1 0x0020
#endif
#ifndef TBCCTL3_
#define TBCCTL3_ 0x0188
#endif
#ifndef TBCCR6_
#define TBCCR6_ 0x019E
#endif
#ifndef WDTIS_0
#define WDTIS_0 0x0000
#endif
#ifndef WDTIS_1
#define WDTIS_1 0x0001
#endif
#ifndef WDTIS_2
#define WDTIS_2 0x0002
#endif
#ifndef WDTIS_3
#define WDTIS_3 0x0003
#endif
#ifndef __PTRDIFF_TYPE__
#define __PTRDIFF_TYPE__ int
#endif
#ifndef TACCTL1_
#define TACCTL1_ TA0CCTL1_
#endif
#ifndef FCTL2_
#define FCTL2_ 0x012A
#endif
#ifndef CALBC1_1MHZ_
#define CALBC1_1MHZ_ 0x10FF
#endif
#ifndef TAIV_OVERFLOW
#define TAIV_OVERFLOW 0x0A
#endif
#ifndef P2IES_
#define P2IES_ 0x002C
#endif
#ifndef TBCCTL4_
#define TBCCTL4_ 0x018A
#endif
#ifndef FCTL3_
#define FCTL3_ 0x012C
#endif
#ifndef MSP430
#define MSP430 1
#endif
#ifndef TBCCTL5_
#define TBCCTL5_ 0x018C
#endif
#ifndef P1IN_
#define P1IN_ 0x0020
#endif
#ifndef TBCCTL6_
#define TBCCTL6_ 0x018E
#endif
#ifndef DIVM0
#define DIVM0 0x10
#endif
#ifndef DIVM1
#define DIVM1 0x20
#endif
#ifndef __msp430_headers_compa_h
#define __msp430_headers_compa_h 
#endif
#ifndef UCB1CTL0_
#define UCB1CTL0_ 0x00D8
#endif
#ifndef P6DIR_
#define P6DIR_ 0x0036
#endif
#ifndef TBIV_CCR1
#define TBIV_CCR1 0x02
#endif
#ifndef TBIV_CCR2
#define TBIV_CCR2 0x04
#endif
#ifndef TBIV_CCR3
#define TBIV_CCR3 0x06
#endif
#ifndef TBIV_CCR4
#define TBIV_CCR4 0x08
#endif
#ifndef TBIV_CCR5
#define TBIV_CCR5 0x0A
#endif
#ifndef TBIV_CCR6
#define TBIV_CCR6 0x0C
#endif
#ifndef UCA1TXBUF_
#define UCA1TXBUF_ 0x00D7
#endif
#ifndef DCOCTL_
#define DCOCTL_ 0x0056
#endif
#ifndef CPUOFF
#define CPUOFF 0x0010
#endif
#ifndef UCB1CTL1_
#define UCB1CTL1_ 0x00D9
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2
#endif
#ifndef WDTNMIES
#define WDTNMIES 0x0040
#endif
#ifndef UCA1CTL0_
#define UCA1CTL0_ 0x00D0
#endif
#ifndef UCA0TXBUF_
#define UCA0TXBUF_ 0x0067
#endif
#ifndef __REGISTER_PREFIX__
#define __REGISTER_PREFIX__ 
#endif
#ifndef UCA1MCTL_
#define UCA1MCTL_ 0x00D4
#endif
#ifndef UCA1CTL1_
#define UCA1CTL1_ 0x00D1
#endif
#ifndef TLV_DCO_30_TAG_
#define TLV_DCO_30_TAG_ 0x10F6
#endif
#ifndef P2OUT_
#define P2OUT_ 0x0029
#endif
#ifndef OSCOFF
#define OSCOFF 0x0020
#endif
#ifndef PORT1_VECTOR
#define PORT1_VECTOR 4
#endif
#ifndef FRKEY
#define FRKEY 0x9600
#endif
#ifndef __MSP430_HAS_TA3__
#define __MSP430_HAS_TA3__ 
#endif
#ifndef DIVS0
#define DIVS0 0x02
#endif
#ifndef DIVS1
#define DIVS1 0x04
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1
#endif
#ifndef CAREF_VT
#define CAREF_VT CAREF_3
#endif
#ifndef __NO_INLINE__
#define __NO_INLINE__ 1
#endif
#ifndef __MSP430_HAS_USCI_AB0__
#define __MSP430_HAS_USCI_AB0__ 
#endif
#ifndef __MSP430_HAS_USCI1__
#define __MSP430_HAS_USCI1__ 
#endif
#ifndef SELM1
#define SELM1 0x80
#endif
#ifndef UCA0IRRCTL_
#define UCA0IRRCTL_ 0x005F
#endif
#ifndef SCCI
#define SCCI 0x0400
#endif
#ifndef P2SEL_
#define P2SEL_ 0x002E
#endif
#ifndef CAPD0
#define CAPD0 0x01
#endif
#ifndef CAPD1
#define CAPD1 0x02
#endif
#ifndef CAPD2
#define CAPD2 0x04
#endif
#ifndef CAPD3
#define CAPD3 0x08
#endif
#ifndef CAPD4
#define CAPD4 0x10
#endif
#ifndef CAPD5
#define CAPD5 0x20
#endif
#ifndef CAPD6
#define CAPD6 0x40
#endif
#ifndef CAREF_025
#define CAREF_025 CAREF_1
#endif
#ifndef __VERSION__
#define __VERSION__ "3.2.3"
#endif
#ifndef C
#define C 0x0001
#endif
#ifndef P4REN_
#define P4REN_ 0x0011
#endif
#ifndef N
#define N 0x0004
#endif
#ifndef CAPD_
#define CAPD_ 0x005B
#endif
#ifndef V
#define V 0x0100
#endif
#ifndef Z
#define Z 0x0002
#endif
#include "CPU/Variants/Variant.h"
#include "CPU/Variants/VariantManager.h"

class Variant_msp430x24x1 : public Variant {
	public:
		Variant_msp430x24x1() {}
		virtual ~Variant_msp430x24x1() {}
		const char *getName() { return "msp430x24x1"; }

		unsigned int getP1DIR() {
#ifdef P1DIR_
			return P1DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP1IE() {
#ifdef P1IE_
			return P1IE_;
#else
			return 0;
#endif
		}


