jankaluza/qsimkit/CPU/Variants/msp430x24x1.cpp
		unsigned int getP1IES() {
#ifdef P1IES_
			return P1IES_;
#else
			return 0;
#endif
		}


		unsigned int getP1IFG() {
#ifdef P1IFG_
			return P1IFG_;
#else
			return 0;
#endif
		}


		unsigned int getP1IN() {
#ifdef P1IN_
			return P1IN_;
#else
			return 0;
#endif
		}


		unsigned int getP1OUT() {
#ifdef P1OUT_
			return P1OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP1REN() {
#ifdef P1REN_
			return P1REN_;
#else
			return 0;
#endif
		}


		unsigned int getP1SEL() {
#ifdef P1SEL_
			return P1SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP2DIR() {
#ifdef P2DIR_
			return P2DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP2IE() {
#ifdef P2IE_
			return P2IE_;
#else
			return 0;
#endif
		}


		unsigned int getP2IES() {
#ifdef P2IES_
			return P2IES_;
#else
			return 0;
#endif
		}


		unsigned int getP2IFG() {
#ifdef P2IFG_
			return P2IFG_;
#else
			return 0;
#endif
		}


		unsigned int getP2IN() {
#ifdef P2IN_
			return P2IN_;
#else
			return 0;
#endif
		}


		unsigned int getP2OUT() {
#ifdef P2OUT_
			return P2OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP2REN() {
#ifdef P2REN_
			return P2REN_;
#else
			return 0;
#endif
		}


		unsigned int getP2SEL() {
#ifdef P2SEL_
			return P2SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP3DIR() {
#ifdef P3DIR_
			return P3DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP3IN() {
#ifdef P3IN_
			return P3IN_;
#else
			return 0;
#endif
		}


		unsigned int getP3OUT() {
#ifdef P3OUT_
			return P3OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP3REN() {
#ifdef P3REN_
			return P3REN_;
#else
			return 0;
#endif
		}


		unsigned int getP3SEL() {
#ifdef P3SEL_
			return P3SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP4DIR() {
#ifdef P4DIR_
			return P4DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP4IN() {
#ifdef P4IN_
			return P4IN_;
#else
			return 0;
#endif
		}


		unsigned int getP4OUT() {
#ifdef P4OUT_
			return P4OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP4REN() {
#ifdef P4REN_
			return P4REN_;
#else
			return 0;
#endif
		}


		unsigned int getP4SEL() {
#ifdef P4SEL_
			return P4SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP5DIR() {
#ifdef P5DIR_
			return P5DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP5IN() {
#ifdef P5IN_
			return P5IN_;
#else
			return 0;
#endif
		}


		unsigned int getP5OUT() {
#ifdef P5OUT_
			return P5OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP5REN() {
#ifdef P5REN_
			return P5REN_;
#else
			return 0;
#endif
		}


		unsigned int getP5SEL() {
#ifdef P5SEL_
			return P5SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP6DIR() {
#ifdef P6DIR_
			return P6DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP6IN() {
#ifdef P6IN_
			return P6IN_;
#else
			return 0;
#endif
		}


		unsigned int getP6OUT() {
#ifdef P6OUT_
			return P6OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP6REN() {
#ifdef P6REN_
			return P6REN_;
#else
			return 0;
#endif
		}


		unsigned int getP6SEL() {
#ifdef P6SEL_
			return P6SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP7DIR() {
#ifdef P7DIR_
			return P7DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP7IN() {
#ifdef P7IN_
			return P7IN_;
#else
			return 0;
#endif
		}


		unsigned int getP7OUT() {
#ifdef P7OUT_
			return P7OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP7REN() {
#ifdef P7REN_
			return P7REN_;
#else
			return 0;
#endif
		}


		unsigned int getP7SEL() {
#ifdef P7SEL_
			return P7SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP8DIR() {
#ifdef P8DIR_
			return P8DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP8IN() {
#ifdef P8IN_
			return P8IN_;
#else
			return 0;
#endif
		}


		unsigned int getP8OUT() {
#ifdef P8OUT_
			return P8OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP8REN() {
#ifdef P8REN_
			return P8REN_;
#else
			return 0;
#endif
		}


		unsigned int getP8SEL() {
#ifdef P8SEL_
			return P8SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP9DIR() {
#ifdef P9DIR_
			return P9DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP9IN() {
#ifdef P9IN_
			return P9IN_;
#else
			return 0;
#endif
		}


		unsigned int getP9OUT() {
#ifdef P9OUT_
			return P9OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP9REN() {
#ifdef P9REN_
			return P9REN_;
#else
			return 0;
#endif
		}


		unsigned int getP9SEL() {
#ifdef P9SEL_
			return P9SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP10DIR() {
#ifdef P10DIR_
			return P10DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP10IN() {
#ifdef P10IN_
			return P10IN_;
#else
			return 0;
#endif
		}


		unsigned int getP10OUT() {
#ifdef P10OUT_
			return P10OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP10REN() {
#ifdef P10REN_
			return P10REN_;
#else
			return 0;
#endif
		}


		unsigned int getP10SEL() {
#ifdef P10SEL_
			return P10SEL_;
#else
			return 0;
#endif
		}


};

MSP430_VARIANT("msp430x24x1", msp430x24x1);

